emas/loadtest/emas-performance-report/raw_data/sp1/250cus/varnish_ab_test_250_10000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      250
Time taken for tests:   0.568 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      325520000 bytes
HTML transferred:       319660000 bytes
Requests per second:    17615.62 [#/sec] (mean)
Time per request:       14.192 [ms] (mean)
Time per request:       0.057 [ms] (mean, across all concurrent requests)
Transfer rate:          559984.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        2    6   0.9      6      12
Processing:     4    8   1.1      8      18
Waiting:        1    3   1.5      3      11
Total:          8   14   1.6     14      21

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     14
  75%     14
  80%     14
  90%     15
  95%     18
  98%     20
  99%     21
 100%     21 (longest request)